gap> a:=(1,2,3)
> ;;
gap> G:=Group(a);;
gap> G
> ;
Group([ (1,2,3) ])
brk> AsList(G)
> ;
[ (), (1,2,3), (1,3,2) ]
brk> quit;
gap> S:=SymmetricGroup(3)
> ;
Sym( [ 1 .. 3 ] )
gap> AsList(S);
[ (), (2,3), (1,2), (1,2,3), (1,3,2), (1,3) ]
gap> b:=(1,3)
> ;
(1,3)
gap> G1:=Group(a,b);
Group([ (1,2,3), (1,3) ])
gap> AsList(G1);
[ (), (2,3), (1,2), (1,2,3), (1,3,2), (1,3) ]
gap> c:=(2,3)
> ;
(2,3)
gap> G2:=Group(a,c);
Group([ (1,2,3), (2,3) ])
gap> AsList(G2);
[ (), (2,3), (1,2), (1,2,3), (1,3,2), (1,3) ]
gap> At(G2);
Error, Variable: 'At' must have a value
not in any function at *stdin*:21
gap> At:=KnownPropertiesOfObject;
<Operation "KnownPropertiesOfObject">
gap> At(G2);
[ "IsEmpty", "IsTrivial", "IsNonTrivial", "IsFinite", "CanEasilyCompareElements", "CanEasilySortElements", "IsDuplicateFree", 
  "IsGeneratorsOfMagmaWithInverses", "IsAssociative", "IsGeneratorsOfSemigroup", "IsSimpleSemigroup", "IsRegularSemigroup", 
  "IsInverseSemigroup", "IsCompletelyRegularSemigroup", "IsCompletelySimpleSemigroup", "IsGroupAsSemigroup", "IsMonoidAsSemigroup", 
  "IsOrthodoxSemigroup", "IsFinitelyGeneratedGroup", "IsSubsetLocallyFiniteGroup", "KnowsHowToDecompose", "IsPerfectGroup", 
  "IsSolvableGroup", "IsPolycyclicGroup", "IsInfiniteAbelianizationGroup", "IsNilpotentByFinite", "IsTorsionFree", "IsFreeAbelian" ]
gap> G2.IsEmpty();
Error, illegal access to record component `obj.IsEmpty'
of the object <obj>. (Objects by default do not have record components.
The error might be a relic from translated GAP3 code.) at /Users/ajeeshvt/MathsApps/gap-4.10.0/lib/record.gi:152 called from
<function "unknown">( <arguments> )
 called from read-eval loop at *stdin*:24
you can 'quit;' to quit to outer loop, or
you can 'return;' to continue
brk> quit();
Syntax error: ; expected in *errin*:1
quit();
    ^
brk> quit;
gap> IsEmpty(G2);
false
gap> IsAssociative(G2);
true
gap> size(G2);
Error, Variable: 'size' must have a value
not in any function at *stdin*:26
gap> Size(G2);
6
gap> GeneratorsOfGroup(G2);
[ (1,2,3), (2,3) ]
gap> GeneratorsOfGroup(G2);
[ (1,2,3), (2,3) ]
gap> GeneratorsOfGroup(G2);
[ (1,2,3), (2,3) ]
gap> G1.1
> ;
(1,2,3)
gap> G2.1
> ;
(1,2,3)
gap> G2.2;
(2,3)
gap> G2.3;
Error, illegal access to record component `obj.3'
of the object <obj>. (Objects by default do not have record components.
The error might be a relic from translated GAP3 code.) at /Users/ajeeshvt/MathsApps/gap-4.10.0/lib/record.gi:152 called from
<function "unknown">( <arguments> )
 called from read-eval loop at *stdin*:36
you can 'quit;' to quit to outer loop, or
you can 'return;' to continue
brk> quit;
gap> At(G2);
[ "IsEmpty", "IsTrivial", "IsNonTrivial", "IsFinite", "CanEasilyCompareElements", "CanEasilySortElements", "IsDuplicateFree", 
  "IsGeneratorsOfMagmaWithInverses", "IsAssociative", "IsGeneratorsOfSemigroup", "IsSimpleSemigroup", "IsRegularSemigroup", 
  "IsInverseSemigroup", "IsCompletelyRegularSemigroup", "IsCompletelySimpleSemigroup", "IsGroupAsSemigroup", "IsMonoidAsSemigroup", 
  "IsOrthodoxSemigroup", "IsFinitelyGeneratedGroup", "IsSubsetLocallyFiniteGroup", "KnowsHowToDecompose", "IsPerfectGroup", 
  "IsSolvableGroup", "IsPolycyclicGroup", "IsInfiniteAbelianizationGroup", "IsNilpotentByFinite", "IsTorsionFree", "IsFreeAbelian" ]
gap> s:=SylowSubgroup(G2,2)
> ;
Group([ (2,3) ])
gap> s:=SylowSubgroup(G2,1)
> ;
Error, SylowSubgroup: <p> must be a prime called from
<compiled statement>  called from
<function "unknown">( <arguments> )
 called from read-eval loop at *stdin*:40
you can 'quit;' to quit to outer loop, or
you can 'return;' to continue
brk> quit;
gap> s:=SylowSubgroup(G2,3);
Group([ (1,2,3) ])
gap> s:=SylowSubgroup(G2,5);
Group(())
gap> ?SylowSubgroup
gap> 
gap> s:=SylowSubgroup(G2,3);
Group([ (1,2,3) ])
gap> 
gap> 
gap> Orbits(s,[1..3]);
[ [ 1, 2, 3 ] ]
gap> Orbits(s,[1..7]);
[ [ 1, 2, 3 ], [ 4 ], [ 5 ], [ 6 ], [ 7 ] ]
gap> ?Orbits
gap> quit
> ;
